class HomeWork2 {
/*
1. Есть строка вида: "1 3 1 2  \n2 3 2 2  \n5 6 7 1  \n3 3 1 0"; (другими словами матрица 4x4)
            1 3 1 2
            2 3 2 2
            5 6 7 1
            3 3 1 0
    Написать метод, на вход которого подаётся такая строка,
    метод должен преобразовать строку в двумерный массив типа String[][];
2. Преобразовать все элементы массива в числа типа int, просуммировать,
    поделить полученную сумму на 2, и вернуть результат;
3. Ваш метод должен бросить исключения в случаях:
    Если размер матрицы, полученной из строки, не равен 4x4;
    Если в одной из ячеек полученной матрицы не число; (например символ или слово) ###
4. В методе main необходимо вызвать полученный метод, обработать возможные исключения и вывести результат расчета.

1. Написать метод, на вход которому подается двумерный строковый массив размером 4х4.
    При подаче массива другого размера необходимо бросить исключение MyArraySizeException.
2. Далее метод должен пройтись по всем элементам массива, преобразовать в int и просуммировать.
   Если в каком-то элементе преобразование не удалось (например, если в ячейке лежит символ или текст вместо числа),
   надо бросить исключение MyArrayDataException с детализацией, в какой ячейке неверные данные.
3. В методе main() вызвать полученный метод, обработать возможные исключения MySizeArrayException и MyArrayDataException и вывести результат расчета.
*/
}
